validation/moldCHT-cycle/0/cavity/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\      /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Static pressure minus hydrostatic: gate pressure driven, vent at p0.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/cavity";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            moldingPrghPressure;
        refValue        uniform 1e5;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 1e5;
    }

    vent
    {
        type            moldingVentPressure;
        p0              1e5;
        value           $internalField;
    }

    cavityBottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    cavity_to_mold
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
