validation/moldCHT-cycle/0/mold/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\      /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Mould temperature: initially 353 K; the bottom face is the conjugate
    interface and every outer face is adiabatic, so the whole domain
    is closed except the inlet and vent (global energy check).
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/mold";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 353;

boundaryField
{
    moldSides
    {
        type            zeroGradient;
    }

    moldTop
    {
        type            zeroGradient;
    }

    mold_to_cavity
    {
        type            coupledTemperature;
        Tnbr            T;
        value           $internalField;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
