validation/moldCHT-cycle/system/verifier
verify-moldcht-cycle.py
